Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_176-Vimalakirtinirdesa-v1.tmx
Source language: bo
Languages: en

source: །དེ་དག་གིས་སྨྲས་པ། ཆོས་ཀྱི་ཀུན་དགའ་ལ་དགའ་བ་དེ་གང་ལགས།
en: “They then asked him, ‘What is “joy in the pleasures of the Dharma”?’

source: དེ་ན་ཉན་ཐོས་ཁ་ཅིག་འདི་སྙམ་དུ་སེམས་སོ།
en: But some of the disciples had already had the thought:

source: རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ལ་འདྲིས་པར་བྱེད་པའི་དགའ་བ་དང་།
en: It is the joy of exploration of the three doors of liberation,

source: ཆོས་ཟབ་མོ་ཐོས་པས་མི་སྐྲག་པར་དགའ་བ་དང་།
en: It is the joy of the liberation of non-intimidation when hearing the profound teaching.

source: མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཡོངས་སུ་བསྒྲུབ་པའི་ཕྱིར་དགེ་བ་ཐམས་ཅད་བསགས་པ་ལ་དགའ་བ་དང་།
en: It is the joy of accumulating all virtues, in order to cultivate the auspicious marks and signs.

source: བཅོམ་ལྡན་འདས་མཐོང་ལགས་སོ།
en: “I have seen them, Lord.”

source: །བཟོད་པ་ཐོབ་པ་གང་དག་གིས་ཟོས་པ་དེ་དག་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ་ན་འཇུ་བར་འགྱུར་རོ།
en: And if those who have attained tolerance eat this food, it will be digested when they have become bodhisattvas one lifetime away from buddhahood.

source: །བཙུན་པ་ཀུན་དགའ་བོ་འདི་ལྟ་སྟེ། དཔེར་ན་སྨན་བྲོ་ལྡན་ཞེས་བྱ་བ་ལྟོར་སོང་ན་དུག་ཐམས་ཅད་མེད་པར་མ་གྱུར་གྱི་བར་དུ་མི་འཇུ་སྟེ་སྨན་དེ་ཕྱིས་འཇུ་བར་འགྱུར་རོ།
en: Reverend Ānanda, it is like the medicine called “delicious,” which reaches the stomach but is not digested until all poisons have been eliminated—only then is it digested.

source: ཆོས་ལ་མོས་ཤིང་དད་དེ་མཆོག་ཏུ་དགའ་བའི་དགའ་བ་དང་།
en: It is the joy of the superior gladness of faith and devotion to the Dharma.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་ཀུན་དགའ་ལ་དགའ་ཞིང་མོས་པ་ཡིན་ནོ།
en: Thus, the bodhisattva admires and finds joy in the delights of the Dharma.’

source: ཁམས་དང་སྐྱེ་མཆེད་ཀྱི་འགྲོ་བར་འགྲོ་ཡང་གཟུངས་ཐོབ་ཅིང་སྤོབས་པ་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ་ཡང་ཡིན།
en: “He follows the ways of the dumb and the incoherent, yet, having acquired the power of incantations, he is adorned with a varied eloquence.

source: མུ་སྟེགས་ཅན་གྱི་འགྲོ་བར་འགྲོ་ཡང་མུ་སྟེགས་སུ་གྱུར་པ་ཡང་མ་ཡིན།
en: “He follows the ways of the outsiders without ever becoming an outsider.

source: །དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་ལྷའི་བུ་མོ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “Thereupon, Māra said to the goddesses,

source: །ད་བདག་ཅག་གི་གནས་སུ་འདོང་གིས་ཚུར་ཤོག
en: ‘Now come along and let us return home.’

source: འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་འགྲོ་བར་འགྲོ་ཡང་འགྲོ་བ་ཐམས་ཅད་ལས་ཕྱིར་ལྡོག་པ་ཡང་ཡིན།
en: He follows the ways of all the world, yet he reverses all states of existence.

source: །དེ་དག་གིས་སྨྲས་པ།
en: “They said,

source: ཁྱོད་ཀྱིས་བདག་ཅག་ཁྱིམ་བདག་འདི་ལ་ཕུལ་བས་
en: ‘You gave us to this householder.

source: ད་ནི་ཆོས་ཀྱི་ཀུན་དགའ་ལ་དགའ་ཞིང་མོས་པར་བྱའི། འདོད་པ་ལ་ནི་དགའ་ཞིང་མོས་པར་མི་བྱའོ།
en: Now we should enjoy the delights of the Dharma and should no longer enjoy the pleasures of desires.’

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་འགྲོ་བར་སོང་བ་ཡིན་ནོ།
en: thereby following the way to the qualities of the Buddha.”

source: །དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “Then Māra said to the Licchavi Vimalakīrti,

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་ཞིང་སེམས་འཛིན་པ་མེད་པ་ལགས་ན་
en: ‘If it is so that the bodhisattva, the spiritual hero, has no mental attachment, and gives away all his possessions,

source: ཁྱིམ་བདག་ཁྱོད་ཀྱིས་ལྷའི་བུ་མོ་འདི་རྣམས་དགྱེ་བར་གསོལ།
en: then, householder, please give me these goddesses.’

source: དེ་ལ་ནན་ཏན་གྱིས་ཤིག །དེ་ཡང་གང་ཞེ་ན།
en: Practice it! What is it?

source: སྲིང་མོ་དག་སྒྲོན་མ་གཅིག་ལས་སྒྲོན་མ་བརྒྱ་སྟོང་འབར་བར་བྱས་ཀྱང་སྒྲོན་མ་དེ་འབྲི་བར་མི་འགྱུར་བ་
en: Sisters, a single lamp may light hundreds of thousands of lamps without itself being diminished.

source: དེ་བཞིན་དུ་སྲིང་མོ་དག་བྱང་ཆུབ་སེམས་དཔའ་གཅིག་
en: Likewise, sisters, a single bodhisattva

source: སྲིང་མོ་དག་མི་ཟད་པའི་སྒྲོན་མ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡོད་དེ།
en: Sisters, there is a door of the Dharma called “The Inexhaustible Lamp.”

source: །བྲན་དང་གཡོག་ཏུ་ཤིན་ཏུ་གྱུར།
en: And they become their servants or slaves,

source: །སློབ་མར་ཡང་ནི་ཉེ་བར་འགྲོ།
en: Or serve as their disciples.

source: །རིམ་གྲོ་ལྷུར་བྱེད་སེམས་ཅན་རྣམས། །འཇིགས་པ་མེད་པས་འདིར་མཐོང་ན།
en: “Here in the world, they fearlessly behold Those who are masters to be served,

source: །དེ་ནས་ལྷའི་བུ་མོ་དེ་དག་གིས་དྲི་མ་མེད་པར་གྲགས་པ་ལ་ཕྱག་འཚལ་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “Then the goddesses, saluting Vimalakīrti, said to him,

source: །ཡན་ལག་གང་དང་གང་རྣམས་ཀྱིས། །སེམས་ཅན་ཆོས་ལ་དགར་གྱུར་པ། །ཐབས་ཆེན་ཤིན་ཏུ་བསླབས་པ་དང་། །བྱ་བ་དག་ནི་ཐམས་ཅད་སྟོན།
en: “Well trained in liberative art, They demonstrate all activities, Whichever possibly may be a method To make beings delight in the Dharma.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག
en: May you fulfill the religious aspirations of all living beings!’

source: །དེ་དག་ལྔ་མངོན་ཤེས་པ་ཡི། །དྲང་སྲོང་ཚངས་པར་སྤྱོད་གྱུར་ཏེ། །བཟོད་དང་དེས་པ་ཚུལ་ཁྲིམས་དང་། །སྡོམ་པ་ལ་ནི་སེམས་ཅན་འགོད།
en: “They become great holy men, With the superknowledges and pure continence, And thus induce living beings to the morality Of tolerance, gentleness, and discipline.

source: །ཆོས་ཚོལ་བ་ལ་ལེ་ལོ་མེད་པའོ།
en: having no laziness in seeking the Dharma;

source: །ཡོངས་སུ་བསྔོ་བར་མཁས་པ་ལ་འགོད་པའོ།
en: taking pleasure in skillful dedication;

source: །དགེ་བའི་རྩ་བ་དག་ལ་ཆོག་མི་ཤེས་པའོ།
en: never being satisfied with the roots of virtue already accumulated;

source: །དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་ལུས་དང་སྲོག་འདོར་བའོ།
en: giving up body and life in order to uphold the holy Dharma;

source: །བསྡུ་བའི་དངོས་པོ་མི་གཏོང་བའོ།
en: not abandoning the means of unification;

source: །སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་ལ་མི་སྐྱོ་བའོ།
en: not tiring in the positive development of living beings;

source: །ལྷག་པའི་བསམ་པས་ཡང་དག་པར་བཙུད་པའི་ཐམས་ཅད་མཁྱེན་པའི་སེམས་མི་བརྗེད་པའོ།
en: not forgetting the omniscient mind generated by high resolve;

source: །སྙིང་རྗེ་ཆེན་པོ་མ་བཏང་བའོ།
en: not giving up the great compassion;

source: །དེ་ལ་འདུས་བྱས་མི་ཟད་པ་ནི་འདི་ལྟ་སྟེ། བྱམས་པ་ཆེན་པོ་ལས་མ་ཉམས་པའོ།
en: “Not to destroy compounded things consists in not losing the great love;

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདུས་བྱས་ཟད་པར་མི་བྱ། འདུས་མ་བྱས་ལའང་གནས་པར་མི་བྱའོ།
en: But the bodhisattva should neither destroy the compounded nor rest in the uncompounded.

source: །མི་ཟད་པ་ཞེས་བྱ་བ་ནི་འདུས་མ་བྱས་ཏེ།
en: Indestructible’ refers to the uncompounded.

source: ཟད་པ་ཞེས་བྱ་བ་ནི་འདུས་བྱས་སོ།
en: ‘Destructible’ refers to compounded things.

source: དེ་ཡང་གང་ཞེ་ན།
en: What is it?

source: །དེ་ལ་ཁྱེད་ཀྱིས་བསླབ་པར་བྱ་སྟེ།
en: You must train yourselves in this liberation.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཟད་པ་དང་། མི་ཟད་པ་ཞེས་བྱ་བ་ཡོད་དོ།
en: “Noble sons, there is a liberation of bodhisattvas called destructible and indestructible.

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Thus having been requested,

source: །བཅོམ་ལྡན་འདས་བདག་ཅག་འཇིག་རྟེན་གྱི་ཁམས་སྤོས་ཐམས་ཅད་ཀྱི་དྲི་མཆོག་དེར་མཆིས་ཀྱང་བཅོམ་ལྡན་འདས་རྗེས་སུ་དྲན་པར་འགྱུར་བའི་ཆོས་ཀྱི་རྫོངས་ཤིག་བདག་ཅག་ལ་སྩལ་བར་གསོལ།
en: Lord, please give us a teaching by which we may remember you, when we have returned to Sarva­gandha­sugandhā.”

source: ཇི་ལྟ་ཇི་ལྟ་བུར་བཞེད་པ་དེ་ལྟར་དེ་ལྟ་བུར་ཞིང་བཀོད་པ་སྟོན་ཏོ།
en: they manifest such and such a field to suit the desire of such and such a living being.

source: དེ་དག་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བགྱི་བའི་སླད་དུ།
en: In order to develop living beings,

source: །བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་འདི་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ལ་ངན་པར་འདུ་ཤེས་བསྐྱེད་པ་ཡིད་ལ་བགྱིས་པ་རྣམས་སྤང་བར་འཚལ་ལོ།
en: “Lord, when we first arrived in this buddhafield, we conceived a negative idea, but we now abandon this wrong idea.

source: དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ཞིང་ཚིག་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: saluting the Tathāgata Śākyamuni, addressed him as follows:

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤོས་མཆོག་བརྩེགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ནས་ལྷགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཐལ་མོ་སྦྱར་ཏེ།
en: Then, all those bodhisattvas from the buddhafield of the Tathāgata Gandhottama­kūṭa joined their palms in reverence and,

source: །ཆོས་བསྟན་པ་ལ་སློབ་དཔོན་དཔེ་མཁྱུད་མི་བྱེད་པའོ།
en: being without selfish reticence in teaching the Dharma;

source: །དེ་བཞིན་གཤེགས་པ་ལ་བལྟ་བ་དང་། མཆོད་པའི་དངོས་པོ་ལ་བརྩོན་པའོ།
en: sparing no effort in seeing and worshiping the tathāgatas;

source: །བསམས་བཞིན་དུ་སྐྱེ་བས་མི་སྐྲག་པའོ།
en: being fearless in voluntary reincarnations;

source: །ཆོས་གཟུང་བའི་ཕྱིར་འདོད་པ་ཉུང་ཞིང་ཆོག་ཤེས་པའོ།
en: being content with little desire in order to uphold the Dharma;

source: །ང་རྒྱལ་མེད་པའི་ཕྱིར་ཡེ་ཤེས་ཚོལ་བའོ།
en: seeking knowledge in order to avoid pride;

source: །བདུད་ཀྱི་སྡེ་གཞོམ་པའི་ཕྱིར་བརྩོན་འགྲུས་འབར་བའོ།
en: blazing with energy to conquer the host of demons;

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཁོང་དུ་ཆུད་པ་དང་། དགེ་བའི་ཆོས་ཀྱིས་མངོན་པར་བསྒྲུབས་པའི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་འབྱུང་བ་དེ་ནི་
en: and of the attainment of all the aids to enlightenment, consummated in the realization of the gnosis of omniscience as well as in accomplishment of all virtue.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་བདག་གི་ཞིང་དུ་སྒྲུབ་པའོ།
en: establishing the virtues of all buddhafields in one’s own buddhafield;

source: ཉོན་མོངས་པ་ཐམས་ཅད་དང་། བསྒྲིབས་པ་ཐམས་ཅད་དང་། མི་དགེ་བའི་ཆོས་ཐམས་ཅད་སྤོང་བས་མངོན་པར་བསྒྲུབས་པའི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱི་ཚོགས་དང་།
en: of the store of all roots of virtue, consummated in the abandonment of all afflictions, obscurations, and unvirtuous things;

source: །དགེ་བའི་རྩ་བའི་ཚོགས་ཐམས་ཅད་ཀྱིས་ཆོག་མི་ཤེས་ཤིང་།
en: never ceasing accumulation of the roots of virtue;

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལ་བདག་པོ་གཡོག་ཏུ་འདུ་ཤེས་པའོ།
en: considering the aids to enlightenment to be servants;

source: །ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ལ་ཕ་མར་འདུ་ཤེས་པའོ།
en: considering the transcendences to be parents;

source: །ཚུལ་ཁྲིམས་འཆལ་པ་རྣམས་ལ་བསྐྱབ་པར་འདུ་ཤེས་པའོ།
en: considering immoral beings to be saviors;

source: །བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྫོགས་པར་བྱེད་པར་འདུ་ཤེས་པའོ།
en: considering the giving away of all possessions to be the means of realizing buddhahood;

source: །སློང་བ་རྣམས་ལ་དག་པའི་བཤེས་གཉེན་དུ་འདུ་ཤེས་པའོ།
en: considering beggars to be spiritual teachers;

source: །འཁོར་བ་ལ་སྐྱེད་མོས་ཚལ་དང་མྱ་ངན་ལས་འདས་པ་ལྟ་བུར་འདུ་ཤེས་པའོ།
en: conceiving of the world as a garden of liberation;

source: །སྔོན་མ་འོངས། མ་མཐོང་། མ་ཐོས་པ་མཐོང་ངོ་།
en: Here you are, without previously having come, been seen, or been heard.

source: །འཇམ་དཔལ་ཤིན་ཏུ་ལེགས་པར་འོངས་སོ།
en: Mañjuśrī! You are very welcome!

source: །འཇམ་དཔལ་ལེགས་པར་འོངས་སོ།
en: “Mañjuśrī! Welcome,

source: །དེ་ནས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་མཐོང་སྟེ། མཐོང་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then, the Licchavi Vimalakīrti saw the crown prince Mañjuśrī and addressed him thus:

source: །བསམ་གཏན་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་ལ་མནར་མེད་པ་ལྟར་འདུ་ཤེས་པའོ།
en: conceiving of trance, meditation, and equanimity as if they were the Avīci hell;

source: །བདག་གི་བདེ་བ་ལ་མ་ཞེན་ཅིང་ཕ་རོལ་བདེ་བ་ལ་ཞེན་པའོ།
en: not longing for one’s own happiness but longing for the happiness of others;

source: །ཁྲི་གང་ལ་དྲི་མ་མེད་པར་གྲགས་པ་ན་བ་ཉལ་ཞིང་འདུག་པའི་ཁྲི་གཅིག་པོ་དེ་མ་གཏོགས་པར་དེ་ན་ཁྲི་འམ་ཁྲིའུ་འམ། སྟན་གང་ཡང་མི་སྣང་ངོ་།
en: And, except for the invalid’s couch upon which Vimalakīrti himself was lying, no bed or couch or seat could be seen anywhere.

source: །ཕུན་སུམ་ཚོགས་པ་དང་རྒུད་པ་དག་ལ་མ་ཁེངས་མི་འདུད་པའོ།
en: being neither proud in success nor bowed in failure;

source: །མ་བསླབ་པ་རྣམས་ལ་མི་བརྙས་ཤིང་ལོབས་པ་རྣམས་ལ་སྟོན་པ་ལྟར་ཕངས་པར་སེམས་པའོ།
en: not despising the unlearned, and respecting the learned as if they were the Teacher himself;

source: ངན་འགྲོར་སྐྱེས་པའི་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་ཆེན་པོ་མི་སྐྱེད་པའང་མ་ཡིན་ནོ།
en: there is then no sacrifice of the great compassion for all living beings living in the bad migrations.

source: བདག་མེད་པར་སོ་སོར་རྟོག་ཀྱང་བདག་ཡོངས་སུ་འདོར་བའང་མ་ཡིན།
en: He knows selflessnes, but does not waste himself.

source: །སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་རྫོགས་པ་ལ་ཚོར་བ་གཉི་ག་དོར་མོད་ཀྱི་
en: Although both pleasure and pain are abandoned when the buddha-qualities are fully accomplished,

source: སྡུག་བསྔལ་བར་སོ་སོར་རྟོག་ཀྱང་བསམས་བཞིན་དུ་སྐྱེ།
en: He considers misery, but he reincarnates voluntarily.

source: མི་རྟག་པར་སོ་སོར་རྟོག་ཀྱང་དགེ་བའི་རྩ་བས་ཆོག་མི་ཤེས།
en: He knows impermanence but is not complacent about his roots of virtue.

source: མངོན་པར་འདུ་མི་བྱེད་པ་ལ་ཡོངས་སུ་བྱང་བར་བྱེད་ཀྱང་མངོན་པར་འདུ་མི་བྱེད་པ་མངོན་སུམ་དུ་ཡང་མི་བྱེད།
en: He practices non-performance but does not realize non-performance.

source: སྨོན་པ་མེད་པ་ལ་ཡོངས་སུ་བྱང་བར་བྱེད་ཀྱང་སྨོན་པ་མེད་པ་མངོན་སུམ་དུ་ཡང་མི་བྱེད།
en: He practices wishlessness but does not realize wishlessness.

source: མཚན་མ་མེད་པ་ལ་ཡོངས་སུ་བྱང་བར་བྱེད་ཀྱང་མཚན་མ་མེད་པ་མངོན་སུམ་དུ་ཡང་མི་བྱེད།
en: He practices signlessness but does not realize signlessness.

source: དེས་ཚོར་བ་འགོག་པ་ཡང་མངོན་སུམ་དུ་མི་བྱའོ།
en: but he should not realize the cessation of sensation.

source: གང་གི་ཚེ་སྟོང་པ་ཉིད་ལ་བྱང་བར་བྱེད་ཅིང་སྟོང་པ་ཉིད་མངོན་སུམ་དུ་ཡང་མི་བྱེད།
en: The bodhisattva practices voidness, but he does not realize voidness.

source: །ཇི་ལྟར་ན་འདུས་མ་བྱས་ལ་མི་གནས་ཤེ་ན།
en: “What is not resting in the uncompounded?

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ལ་བརྩོན་ཞིང་བྱང་ཆུབ་སེམས་དཔའ་འདུས་བྱས་ཟད་པར་མི་བྱེད་དོ།
en: Noble sons, a bodhisattva who thus applies himself to the Dharma is a bodhisattva who does not destroy the compounded realm.

source: །ཡོན་ཏན་ཐམས་ཅད་ཆུད་མི་ཟ་བས་བག་ཡོད་པ་ཡིན་ཏེ།
en: and being consciously aware at all times not to neglect any good quality.

source: །བསྡུ་བ་དེ་ཡི་བུད་མེད་ཁྱིམ། །གླུ་དབྱངས་ཆོས་རྣམས་སྟོན་པ་པོ།
en: Their consorts are the means of unification, Their music is the teaching of the Dharma.

source: །བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་སྡུད་པས་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་འཛུད་པའོ།
en: gathering together the order of bodhisattvas to attract beings to the Mahāyāna;

source: །འབྲས་བུ་རྣམ་གྲོལ་ཡེ་ཤེས་ཏེ། །ཆོས་ཀྱི་ནོར་ཆེན་སྟོང་པའོ།
en: With trees of the great wealth of the Dharma, And fruits of the gnosis of liberation.

source: །རྣམ་པར་ཐར་པ་རྫིང་ཡིན་ཏེ།
en: “Their pool consists of the eight liberations,

source: ཆོས་ཐམས་ཅད་ལ་མ་ཆགས་པས་སངས་རྒྱས་ཀྱི་སྤྱོད་ལམ་རབ་ཏུ་ཐོབ་པའོ།
en: being without attachment to anything and thus acquiring the behavior of a buddha;

source: །ཏིང་ངེ་འཛིན་གྱི་ཆུ་ཡིས་བཀང་།
en: Filled with the water of concentration,

source: །ལུས་དང་། ངག་དང་། ཡིད་སྡོམ་པས་ཁྱད་པར་དུ་འགྲོ་བ་དང་།
en: disciplining body, speech, and mind, thus maintaining constant spiritual progress;

source: །རྣམ་དག་པད་མས་ཀུན་ཁེབས་པ།
en: Covered with the lotuses of the seven purities—

source: །དེ་ལ་འཁྲུ་བ་དྲི་མ་མེད།
en: Who bathes therein becomes immaculate.

source: །མངོན་ཤེས་དེ་ཡི་བཞོན་པ་སྟེ།
en: “Their bearers are the six superknowledges,

source: །དེས་ནི་བྱང་ཆུབ་མཆོག་རིག་འགྱུར།
en: Thereby they realize supreme enlightenment.

source: །མཛའ་བཤེས་བྱང་ཆུབ་ཡན་ལག་སྟེ།
en: Their friends are the aids to enlightenment;

source: །ཆོས་བསྟན་པར་གསོལ་བ་དང་རྗེས་སུ་ཡི་རང་ཞིང་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་པས་སངས་རྒྱས་ཀྱི་དབྱངས་རབ་ཏུ་ཐོབ་པའོ།
en: inviting the buddhas to teach the Dharma, rejoicing in them, and applauding them, thereby obtaining the melodious voice of a buddha;

source: །ཚད་མེད་པ་བཞི་རབ་ཏུ་བསྐྱེད་པས་ཚངས་པའི་ལམ་དུ་འགོད་པའོ།
en: establishing the path of the pure states of Brahmā by cultivating the four immeasurables;

source: །དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡོངས་སུ་དག་པས་ལྷ་དང་མིའི་ཕུན་སུམ་ཚོགས་པ་མྱོང་བའོ།
en: tasting human and divine success by purifying the path of the ten virtues;

source: །སྤོབས་པ་འཐོབ་པ་རབ་ཏུ་རྙེད་པས་སྤོབས་པ་ཐོགས་པ་མེད་པའོ།
en: having irresistible speech by acquiring unimpeded eloquence;

source: །ཆོས་བསྟན་པའི་ཕྱིར་བྱིན་གྱི་རླབས་ཐོགས་པ་མེད་པའོ།
en: displaying invincible miraculous feats to teach the Dharma;

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐེ་ཙོམ་གཅད་པའི་ཕྱིར། དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་ཤེས་པའོ།
en: understanding the degrees of people’s spiritual faculties to dispel the doubts of all living beings;

source: གིས་སེམས་ཅན་བརྒྱ་སྟོང་མང་པོ་རྣམས་བྱང་ཆུབ་ལ་བཀོད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་དེའི་སེམས་དྲན་པ་མི་འབྲི།
en: may establish many hundreds of thousands of living beings in enlightenment without his mindfulness being diminished.

source: ཡོངས་སུ་མི་འབྲི་བའི་སྟེང་དུ་འཕེལ་ལོ།
en: In fact, not only does it not diminish, it grows stronger.

source: །དེ་བཞིན་དུ་དགེ་བའི་ཆོས་ཐམས་ཅད་ཀྱང་ཇི་ལྟ་ཇི་ལྟར་གཞན་དག་ལ་བསྒོ་ཞིང་བསྟན་པ་དེ་ལྟ་དེ་ལྟར་དགེ་བའི་ཆོས་ཐམས་ཅད་ཀྱིས་རྣམ་པར་འཕེལ་ཏེ།
en: Likewise, the more you teach and demonstrate virtuous qualities to others, the more you grow with respect to these virtuous qualities.

source: འདི་ནི་མི་ཟད་པའི་སྒྲོན་མ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོའོ།
en: This is the door of the Dharma called “The Inexhaustible Lamp.”

source: །བདུད་ཀྱི་གནས་དེ་ན་ཁྱོད་གནས་པའི་ཚེ་ལྷའི་བུ་དང་། ལྷའི་བུ་མོ་ཚད་མེད་པ་རྣམས་བྱང་ཆུབ་ཀྱི་སེམས་ལ་མོས་པར་གྱིས་ཤིག
en: When you are living in the realm of Māra, inspire innumerable gods and goddesses with the spirit of enlightenment.

source: ཁམས་གསུམ་པ་དང་མ་འདྲེས་པ།
en: He is not involved in the three worlds,

source: དྲི་མ་གསུམ་དང་བྲལ་བ།
en: is free of the three defilements,

source: རྣམ་པར་ཐར་པ་གསུམ་གྱི་རྗེས་སུ་མཆིས་པ།
en: is associated with the triple liberation,

source: རིག་པ་གསུམ་ཐོབ་པ།
en: is endowed with the three knowledges,

source: མ་ཐོབ་པ་ཡང་དག་པར་ཐོབ་པ།
en: and has truly attained the unattainable.

source: ཕ་རོལ་ནའང་མ་ལགས་པ།
en: He is neither the other shore,

source: ཚུ་རོལ་ནའང་མ་ལགས་པ།
en: nor this shore,

source: དབུས་ན་ཡང་མ་ལགས་པ།
en: nor that between.

source: རྣམ་པར་རྟོགས་པར་གྱུར་བའང་མ་ལགས་པ།
en: nor is he a non-conception.

source: མཚན་ཉིད་གཅིག་པའང་མ་ལགས་པ། མཚན་ཉིད་ཐ་དད་པའང་མ་ལགས་པ།
en: He has no single nature nor any diversity of natures.

source: རྟོགས་པར་འགྱུར་བའང་མ་ལགས་པ། ཀུན་ཏུ་རྟོགས་པར་འགྱུར་བའང་མ་ལགས་པ།
en: He is not a conception, not a mental construction,

source: མཚན་ཉིད་དང་བཅས་པ་མ་ལགས་པ།
en: nor has he any characteristic.

source: མཚན་ཉིད་མ་མཆིས་པ།
en: He is not without any characteristic,

source: རྒྱུས་མ་བསྐྱེད་པ། རྐྱེན་ལ་རག་མ་ལས་པ།
en: He is not produced from causes, nor does he depend on conditions.

source: གང་དག་བསྒོམ་པའི་རྣལ་འབྱོར་ལ་རྗེས་སུ་སྦྱོར་བ་རྣམས་ལ་སྨོས་ཀྱང་ཅི་འཚལ་ཏེ།
en: there is no need to mention those who apply themselves to the yoga of meditation upon it.

source: དེ་དག་གིས་ངན་སོང་ཐམས་ཅད་ནི་བཅད།
en: They will cut off all possibility of unhappy lives,

source: དེ་དག་གིས་བདེ་འགྲོའི་ལམ་ཐམས་ཅད་ནི་ཕྱེ།
en: will open their way to all fortunate lives,

source: དེ་དག་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ནི་གཟིགས།
en: will always be looked after by all buddhas,

source: དེ་དག་གིས་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ནི་བཅོམ།
en: will always overcome all adversaries,

source: དེ་དག་གིས་བདུད་ཐམས་ཅད་ནི་ཤིན་ཏུ་ཕམ་པར་བགྱིས།
en: and will always conquer all devils.

source: དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་ལམ་ནི་རྣམ་པར་སྦྱངས།
en: They will practice the path of the bodhisattvas,

source: དེ་དག་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་ནི་གནས།
en: will take their places upon the seat of enlightenment,

source: དེ་དག་དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ཡུལ་ལ་ནི་ཡང་དག་པར་འཇུག་པར་འགྱུར་བ་ལགས་སོ།
en: and will have truly entered the domain of the tathāgatas.

source: །དེའི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ནི་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་སུམ་ཅུ་རྩ་དྲུག་ཡོད་དོ།
en: His retinue of disciples numbered thirty-six million billion,

source: །བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ནི་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་བཅུ་གཉིས་ཡོད་དོ།
en: and his retinue of bodhisattvas numbered twelve million billion.

source: །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཆང་བ་དེ་དག་ལ་བདག་འཁོར་ཐམས་ཅད་དང་བཅས་པས་རིམ་གྲོ་དང་གཡོག་བགྱིའོ།
en: Lord, the noble sons and daughters who will teach and practice this exposition of the Dharma will be honored and served by me and my followers.

source: །ལྷའི་དབང་པོ་དེའི་ཚེ་དེའི་དུས་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་རིན་ཆེན་གདུགས་ཞེས་བྱ་བ་གླིང་བཞི་ལ་དབང་བ་རིན་པོ་ཆེ་སྣ་བདུན་དང་ལྡན་པ་ཞིག་བྱུང་སྟེ།
en: In that same era, king of gods, there was a universal monarch called King Ratnacchattra, who reigned over the four continents and possessed seven precious jewels.

source: དེ་ལ་བུ་དཔའ་བ། རྟུལ་ཕོད་པ། ཡན་ལག་མཆོག་གི་གཟུགས་དང་ལྡན་པ། ཕ་རོལ་གྱི་སྡེ་རབ་ཏུ་འཇོམས་པ་སྟོང་དུ་ཚང་བ་ཡོད་དོ།
en: He had one thousand heroic sons, powerful, strong, and able to conquer enemy armies.

source: །རིགས་ཀྱི་བུ་མ་དད་པ་རྣམས་ནི་དད་པ་བསྐྱེད་པར་བགྱི། དད་པ་རྣམས་ནི་ཆོས་དང་ལྡན་པས་བསྲུང་ཞིང་བསྐྱབ་པར་བགྱིའོ།
en: I will inspire the unbelieving with faith, and I will guarantee my help and protection to those who believe and uphold the Dharma.”

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: At these words,

source: བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: the Buddha said to Śakra, the king of the gods,

source: །ལེགས་སོ་ལེགས་སོ།
en: “Excellent! Excellent,

source: །ལྷའི་དབང་པོ་ཁྱོད་ཀྱིས་ལེགས་པར་སྨྲས་པ་དེ་ལ་དེ་བཞིན་གཤེགས་པ་ཡང་རྗེས་སུ་ཡི་རང་ངོ་།
en: king of gods! The Tathāgata rejoices in your good words.

source: །དེ་ལྟར་ན་ཁྱེད་དེ་བཞིན་གཤེགས་པ་ལ་བྱས་པ་གཟོ་བར་འགྱུར་རོ།
en: In such a way, you will repay the kindness of the Tathāgata,

source: །ལྷའི་དབང་པོ་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བྱང་ཆུབ་དེ་ནི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་བསྟན་ཏོ།
en: King of gods, the enlightenment of the buddhas of the past, present, and future is expressed in this discourse of Dharma.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཚོ་བར་ཡང་འགྱུར་རོ།
en: and you will become the benefactors of all living beings.

source: །དེ་ནས་ལྷའི་བུ་མོ་དེ་དག་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པའི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་བདུད་དང་ལྷན་ཅིག་སླར་མཆིས་སོ།
en: ’“Then, those goddesses bowed at the feet of the Licchavi Vimalakīrti and departed in the company of Māra.

source: །བཅོམ་ལྡན་འདས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པའི་རྣམ་པར་འཕྲུལ་པའི་ཁྱད་པར་དེ་བདག་གིས་མཐོང་སྟེ།
en: Thus, Lord, I saw the supremacy of the magical power, wisdom, and eloquence of the Licchavi Vimalakīrti,

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚོང་དཔོན་གྱི་བུ་ལེགས་པར་བྱིན་ལ་བཀའ་སྩལ་པ།
en: The Buddha then said to the merchant’s son, Sudatta,

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྨན་གྱི་རྒྱལ་པོ་དེའི་ཚེའི་ཚད་ནི་བར་གྱི་བསྐལ་པ་ཉི་ཤུར་གྱུར་ཏོ།
en: “The length of life of this perfectly and fully enlightened Tathāgata Bhaiṣajyarāja was twenty short eons.

source: རིགས་ཀྱི་བུ་ཁྱོད་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པའི་ནད་འདྲིར་སོང་ཤིག
en: “‌Noble son, go to the Licchavi Vimalakīrti to inquire about his illness.”

source: །ལེགས་པར་བྱིན་གྱིས་ཀྱང་གསོལ་པ།
en: Sudatta replied,

source: །གོས་དང་རྒྱན་ཅི་ཐོགས་པ་རྣམས་བཅོམ་ལྡན་འདས་དེ་ལ་ཕུལ་ནས་ཚིག་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: and, taking his robes and ornaments, he offered them to the Buddha Bhaiṣajyarāja, saying,

source: །ལྷའི་དབང་པོ་དེ་ལྟར་རྒྱལ་བུ་ཟླ་གདུགས་དེ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་རྒྱལ་པོ་དེ་ལས་ཆོས་ཀྱི་མཆོད་པ་དེ་ལྟ་བུ་ཐོས་པ་དང་རྗེས་སུ་འཐུན་པའི་ཆོས་ཀྱི་བཟོད་པ་ཐོབ་བོ།
en: “King of gods, when the prince Candracchattra had heard this definition of Dharma-worship from the Tathāgata Bhaiṣajyarāja, he attained the conformative tolerance of ultimate birthlessness,

source: །ཟང་ཟིང་གི་མཆོད་སྦྱིན་གྱིས་ཁྱོད་ལ་ཅི་ཞིག་བྱ།
en: What is the use of the sacrifice of material things?’“

source: གདུགས་བདུན་དུ་མཆོད་སྦྱིན་ཆེན་པོ་བགྱིད་པ་དེར་གདུགས་ཐ་མ་དེར་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་མཆོད་སྦྱིན་ཆེན་པོའི་ས་དེར་མཆིས་ནས་བདག་ལ་འདི་སྐད་ཅེས་མཆིའོ།
en: On the seventh and final day of this great sacrifice, the Licchavi Vimalakīrti came there and said,

source: ལྷས་སྨྲས་པ།
en: The gods replied,

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་བདག་གིས་མངོན་པར་འཚལ་བ་དུས་གཅིག་ན་
en: Why? Lord, I remember one day

source: ཆོས་ཀྱི་མཆོད་པ་དེ་གང་ཡིན།
en: ‘What is this “Dharma-worship”?’“

source: །སྐྱེས་བུ་དམ་པ་ཆོས་ཀྱི་མཆོད་པ་ནི་མཆོད་པ་ཐམས་ཅད་ཀྱི་ནང་ན་མཆོག་གོ།
en: ‘Good man, the supreme worship is Dharma-worship.’“

source: བདག་གིས་དེ་ལ་འདི་སྐད་ཅེས་བགྱིས་སོ།
en: I then asked him,

source: །ཚོང་དཔོན་གྱི་བུ་ཇི་ལྟར་ཁྱོད་མཆོད་སྦྱིན་བྱེད་པ་དེ་ལྟར་མཆོད་སྦྱིན་མི་བྱའི་ཁྱོད་ཀྱིས་ཆོས་ཀྱི་མཆོད་སྦྱིན་བྱའོ།
en: ‘Merchant’s son, you should not celebrate a sacrifice in this way. You should celebrate a Dharma-sacrifice.

source: དེས་བདག་ལ་སྨྲས་པ།
en: “He replied,
